In [1]:
import pandas as pd

In [4]:
## create series from a dictionary
data_dict = {'a': 1, 'b': 2, 'c': 3}
series_from_dict = pd.Series(data_dict)
print(series_from_dict)

a    1
b    2
c    3
dtype: int64

In [5]:
## index series
data = [1, 2, 3, 4, 9]
index = ['a', 'b', 'c', 'd', 'e']
pd.Series(data, index=index)
## series_with_index = pd.Series(data, index=index)
## print(series_with_index)

a    1
b    2
c    3
d    4
e    9
dtype: int64

In [ ]:
## DataFrame
## A DataFrame is a two-dimensional labeled data structure with columns of potentially different types.

In [8]:
 ##Dataframe
## create a dataframe from a dictionary off list
data={
    'name': ['Amit', 'Swapnil', 'Harshit'],
    'age': [23, 22, 24],
    'city': ['New York', 'Los Angeles', 'Chicago']
}
df=pd.DataFrame(data)

print(df)
print(type(df))  # Check the type of the DataFrame

      name  age         city
0     Amit   23     New York
1  Swapnil   22  Los Angeles
2  Harshit   24      Chicago
<class 'pandas.core.frame.DataFrame'>

In [2]:
import numpy as np
#np.array(df)

In [ ]:
## create a dataframe from a list of dictionaries
data = [
    {'name': 'Amit', 'age': 30, 'city': 'Noida'},
    {'name': 'Billu', 'age': 25, 'city': 'Lapataganj'},
    {'name': 'Charlie', 'age': 35, 'city': 'Chicago'},
        {'name': 'Shobhit', 'age':None , 'city': 'Noida'},
    {'name': 'Shweta', 'age': 25, 'city':None }

]
df = pd.DataFrame(data)
df.isna().sum()  # Count of missing values in each column
df.fillna({'age': df['age'].mean(), 'city': 'Unknown'}, inplace=True)
print(df)
#print(df.dropna(subset=['age']))
print(df.dropna(thresh=2))
#df.fillna({'age': df['age'].mean(), 'city': 'Unknown'}, inplace=True)
#print(df)
#print(type(df))  # Check the type of the DataFrame
## Data manipulation with DataFrame
#df['Salary'] = [50000, 60000, 70000] #Add a column 
## drop a column 
#agar temprory karna hai to inplace use nhi krenge and if we use inplace=True then it affect permanent

#df.drop('city', axis=1, inplace=True)  # Drop the 'city' column
## ADD AGE TO THE COLUMN with manipulation of data (if changfe column name the create a new column Aautomatically
#df['age_inc'] = df['age'] + 5
#df['age_dec'] = df['age'] - 5
## jab hame use columne me manipulation karna ho tab
# df['age'] = df['age'] + 1  # Increment the 'age' column by 1
#print(df)

      name    age        city
0     Amit  30.00       Noida
1    Billu  25.00  Lapataganj
2  Charlie  35.00     Chicago
3  Shobhit  28.75       Noida
4   Shweta  25.00     Unknown
      name    age        city
0     Amit  30.00       Noida
1    Billu  25.00  Lapataganj
2  Charlie  35.00     Chicago
3  Shobhit  28.75       Noida
4   Shweta  25.00     Unknown

In [17]:
## csv file kaise padhe same folder me hona chahiye 

# df=pd.read_csv('data.csv')
# df.head(5)
# #print(df.shape)
# ##df.tail(5)
# # print(df.columns)
# # print(df.info())
# # print(df.describe())
# ##print(df.tail(5))  # Display the last 5 rows of the DataFrame
# ##df
# ##df['Value']
##df.loc[0]
##df.iloc[0]

In [36]:
#a=pd.read_csv('PandasExample.csv')
print("***********************1.***************************\n\n")
# a.head(10)
# print(df.shape)
# #print(data)
# df.tail(5)
# print(df.columns)
# print(df.info())
# print(df.describe())
# print(df.tail(5))  # Display the last 5 rows of the DataFrame
# df['Value']

***********************1.***************************

In [ ]:
## Accessing  a specific element 
## print(df)
#df.at[1,'Sales']
df.iat[1, 2]  # Accessing the element at row index 1 and column index 2
df.describe() ## kafi kuch automate krega

           Value       Sales
count  47.000000   46.000000
mean   51.744681  557.130435
std    29.050532  274.598584
min     2.000000  108.000000
25%    27.500000  339.000000
50%    54.000000  591.500000
75%    70.000000  767.500000
max    99.000000  992.000000

In [58]:
## Data manipulation with DataFrame
print(df)

      name  age  Salary  age_inc  age_dec
0     Amit   31   50000       35       25
1    Billu   26   60000       30       20
2  Charlie   36   70000       40       30

DATA TRANSFORMATION

> dropn na
> drop columns
> drop by subset
> drop by thres
> drop by how any 
> drop by how all

In [ ]:
data = [
    {'name': 'Amit', 'age': 30, 'city': 'Noida'},
    {'name': 'Billu', 'age': 25, 'city': 'Lapataganj'},
    {'name': 'Charlie', 'age': 35, 'city': 'Chicago'},
        {'name': 'Shobhit', 'age':None , 'city': 'Noida'},
    {'name': 'Shweta', 'age': 25, 'city':None }

]
z = pd.DataFrame(data)
#z.head()
#print(z.dropna(axis=1))
#print(z.dropna(how='all'))
#print(z.drop(columns=['name']))
#z.dropna(subset=['age'])

# z.dropna(how='any')
# z.dropna(how='all')

#print(z.dropna(thresh=1))
#z.drop('city', axis=1, inplace=True)  # Drop the 'city' column

      name   age        city
0     Amit  30.0       Noida
1    Billu  25.0  Lapataganj
2  Charlie  35.0     Chicago

In [ ]:
tt=pd.DataFrame({
    "A": [1,2,None,4,5],
    "B": [10.0,np.nan,30.0,np.nan,50.0],
    "C": ["x",None ,"z",None,"w"],
    "D": [None,None,None,3.14,2.71],
    "E": [None,2,None,None,5]
})

# tt_inplace=tt.copy()
# print(tt_inplace.dropna(subset=['A'],inplace=False))

#print("detect missing the isna() \n",tt.isna())
#print("detect \n",tt.isna().sum())
#print("detect \n",tt.isnull())
#print("detect not missing values \n",tt.isnotna())
#print("detect ",tt.isna().sum(axis=1))
#print("detect ",tt.dropna())
#tt.inplace
#print("detect \n",tt.dropna(axis=1,thresh=3))
#rint("detect \n",tt.dropna(axis=0,thresh=3))
# print(tt.dropna(subset=['A','B']))
#tt.dropna(how='any')
##tt.dropna(how='all')
# print(tt)
# print(tt.fillna({
#     'A':tt['A'].mean(),
#     'B':tt['B'].mean(),
#     'C':tt['C'].mode()[0],
#     'D':tt['D'].mean(),
#     'E':tt['E'].mean()
# }, inplace=True))

# tt.fillna({'A':0,'B':0,'C':'Unknown','D':0,'E':0}, inplace=True)

#  ffill and bfill not done 

# tt.fillna(method='ffill', inplace=True)
# tt=tt.ffillna()
# print(tt.fillna(method='bfill', inplace=True))

tt_interpolate=tt.copy()
tt_interpolate['A']=tt_interpolate['A'].interpolate()
print(tt)
# Interpolate along the index with linear method and data time etc

     A     B     C     D    E
0  1.0  10.0     x   NaN  NaN
1  2.0   NaN  None   NaN  2.0
2  NaN  30.0     z   NaN  NaN
3  4.0   NaN  None  3.14  NaN
4  5.0  50.0     w  2.71  5.0

CREATE A DEMO DATAFRAME WITH DUPLICATE

In [ ]:
data={
    'name': ['Amit', 'Swapnil', 'Harshit','Amit','Harshit','Shobhit'],
    'age': [23, 22, 24,23,24,25],
    'city': ['New York', 'Los Angeles', 'Chicago','New York', 'Chicago','Noida']
}
df=pd.DataFrame(data)
print("\tORIGINAL DATAFRAME:\n")
print(df,"\n")

# print("\t Duplicated Boolean Value:\n")
# print("booleaan masking for duplicate rows:\n",df.duplicated(),"\n" )

# print("\t Duplicated Rows:\n")
# print("duplicate rows are:\n",df[df.duplicated()])

# print("\t DataFrame after removing Duplicated Rows:\n")
# print(df.drop_duplicates(),"\n")    

# print("\t Duplicated Boolean Value based on 'age' column:\n"  )
# print(df.duplicated(subset=['age']),"\n" )

# print("\t keep last Duplicated Boolean Value based on 'age' column:\n"  )
# print(df.duplicated(subset=['age'],keep='last'),"\n" )
# print(df.duplicated(subset=['age'],keep='first'),"\n" )
#print(df[df.duplicated(subset=['age'],keep=False)],"\n" )

# print("\t Duplicated Rows based on 'age' column:\n")
# print(df[df.duplicated(subset=['age'])],"\n")

# print("\t DataFrame after removing Duplicated Rows based on 'name' column:\n")
# print(df.drop_duplicates(subset=['name']),"\n")

	ORIGINAL DATAFRAME:

      name  age         city
0     Amit   23     New York
1  Swapnil   22  Los Angeles
2  Harshit   24      Chicago
3     Amit   23     New York
4  Harshit   24      Chicago
5  Shobhit   25        Noida

      name  age      city
0     Amit   23  New York
2  Harshit   24   Chicago
3     Amit   23  New York
4  Harshit   24   Chicago